  22 00
   8 000
   2 01
   1 03
   5 05
   2 06
   2 07
   3 08
 126 10
  90 100
   1 1000
   2 102
   1 1028
   1 1042
   2 105m²
   1 1061
   1 109
  94 10_minut
  28 11
   8 110
   1 1107
   1 1134
   1 115m²
   1 1173
   1 118
   1 119
  40 12
   6 120
   1 1200
   1 1218
   1 1223
   2 124
   1 1240
   3 125
   1 1268
  12 13
   1 130
   1 1317
   1 138
   1 1382
   1 13th
  16 14
   3 140
   3 1438
   1 1476
  75 15
  21 150
   1 1508
   1 151
   1 1524
   2 1592
  56 15_minut
   2 15th
  11 16
   4 160
   6 162
   3 16th
  10 17
   1 170
   1 1700
   1 171
   2 1725
   3 1764
   2 1789
   1 17th
  96 18
   1 180
   2 1825
   1 1833
   2 1843
   1 1854
   1 1857
   1 1865
   1 1870
   1 1871
   2 1876
   1 1884
   2 1891
   4 1896
   1 1899
  57 18_hole
   9 18th
  52 19
   2 1900
   2 1904
   2 1906
   2 1907
   2 1909
   1 1910
   1 1915
   2 1918
   1 1930
   1 1931
   1 1933
   1 1936
   1 1945
   1 1950
   2 1963
   1 1964
   2 1969
   1 1977
   2 1990
   6 19th
   1 1st
  76 20
 120 200
   1 2003
   2 2004
   4 2005
   6 2006
   2 2007
   3 2008
   1 2009
   2 201
   3 2010
   2 2011
   5 2012
   8 2013
   9 2014
   8 2015
   5 2016
   5 2017
   1 2021
   1 2078
   9 21
   3 210
   2 211
   2 212
   4 215
   2 21st
  21 22
   2 220
   1 2263
  12 22a
  20 23
 106 24
  93 24_hour
  68 25
  21 250
   2 25000
   2 26
   4 260
   2 27
   1 270
   1 2762
   1 27m²
  11 28
   5 29
   9 2m2c
  54 30
 143 300
   3 3000
   1 30m²
  17 31
  18 32
   2 320
  10 33
   7 34
   1 3493
  38 35
   7 350
   6 36
  12 37
   8 38
   1 3822
   1 39
   1 3903
   5 3rd
  24 40
  53 400
   7 41
   6 42
   1 420
   6 43
  13 44
  18 45
   8 450
   1 45km
  10 46
   6 47
   2 470
   1 48
   7 49
   2 4th
   9 4x4
  51 50
  94 500
   1 51
   4 52
   2 520
   2 53
   1 535
   2 54
   2 543
   3 55
   2 550
   9 56
   1 56m²
  19 57
   1 58
   6 59
   1 594
   1 5th
  22 60
  36 600
   1 607
   4 61
   3 62
   1 63
   2 639
   8 64
   1 640
   1 642
   1 644
   1 648
   1 657
  28 66
   5 67
  14 68
   2 69
   1 696
   4 6th
   6 70
  49 700
   3 70m²
   6 71
   1 711
   8 72
   1 723
  43 73
  21 74
   2 75
   6 750
   1 752
   1 753
   3 76
   1 77
   1 77m²
   1 786
   8 7e
   2 7th
   8 80
  64 800
   1 809
   3 835
   5 850
   2 862
   1 890
   1 8th
   6 90
  42 900
   2 913
   1 950
   1 964
   1 968
   1 975
   1 987
   1 997
   2 9b
   8 a1
   4 a16
   1 a18
   2 a3
   1 a32
   1 a38
   2 a4
   2 a46
   1 a54
   1 a8
   8 a9
   4 abbey
   7 abl
   2 aboard
   4 abri
   2 absinth
   1 acacia
   2 accademia
 272 access
 270 accommod
 125 accomod
 219 accord
 218 accord_independ
   2 acquapark
   1 acr
   5 across
  59 activ
   2 adagio
   2 adam
 188 addict
 406 addit
   3 adjac
   1 adjoin
   7 admir
   2 admiss
   3 adriatica
   2 adult
  11 advantag
   4 adventur
   1 advis
   1 aeroplan
   1 aeroport
   3 afghan
   2 agat
   5 age
   2 agent
   1 ago
   1 agreeabl
  14 aigl
 146 air
 138 air_condit
   5 airell
 618 airport
  28 airport_66
   3 aisha
   4 alagar
   4 albatro
   2 alcohol
   1 alcov
   3 alexi
   3 alimentarium
   1 allaman
   1 allerg
   2 allergi
   1 alley
   2 allèv
   2 almost
   6 along
   1 alongsid
  94 alp
   1 alpaca
   2 alpen
   3 alpha
  28 alpin
   1 alreadi
 795 also
 188 also_one
   1 altitud
   2 alway
   1 amaz
   3 ambassador
   1 ambianc
   3 ambienc
   1 ambient
  16 amen
   2 american
   5 amid
   2 amidst
  15 among
   5 amongst
   3 amphitheatr
   2 ampl
   1 américain
   6 ancient
   6 ang
   1 anglai
   9 angleterr
   1 angus
   3 anneci
   4 annedo
   1 anoth
   4 answer
   1 anti
   3 antiqu
   4 antoin
 877 apart
   5 aparthotel
   1 aparté
   2 aperitif
  42 appart
   3 appl
   1 appoint
 394 appreci
   1 approach
   2 april
  16 apt
   1 apéritif
   1 aqua
  17 aquaparc
   1 aquapark
   3 aquati
   1 arabesqu
   4 arbezi
   9 arbr
   3 arcad
   8 architectur
 605 area
 143 area_coupl
   6 argentièr
   1 ariana
   5 armchair
   1 armi
   2 armori
   5 armur
   5 arnica
   3 aroll
   2 aromatherapi
  29 around
  14 arrang
   5 array
  22 arriv
  11 arset
  21 art
   3 artisan
   6 artist
  62 arvey
   1 asian
   2 aspect
   2 asprey
   1 assist
   1 associ
   3 astoria
   5 ateli
  17 atmospher
   2 atrium
   2 attent
   2 attic
  15 attract
  34 au
  96 auberg
  41 auberg_de
   5 auberson
   9 aubonn
   1 audio
  22 audiovisuel
   1 august
   1 aulac
   1 aulien
   6 auteuil
   6 authent
   2 autorout
   8 aux
 505 avail
  74 avail_site
   2 availableat
   3 avec
   1 aveda
  13 avench
   2 avenir
  13 aventur
   1 avoriaz
  10 award
 505 away
   3 ayern
   2 ayurved
   4 azurit
   4 aérodrom
   4 aéroport
  11 aï
   2 b11
   1 b15
   1 b18
   4 b2
   1 b3
   1 b42
   2 b5
   4 b52
   1 b7
   2 b8
   3 babysit
   6 back
   2 backdrop
   1 background
   3 backpack
   3 bag
   4 bahys
   8 baie
  68 bain
  26 baker
  13 bakeri
   3 balanc
   7 balcon
 240 balconi
   4 balexert
   4 ballaigu
   3 balmor
   1 balneotherapi
   6 balzac
   1 band
  24 bank
   4 banquet
 213 bar
  39 barbecu
   2 barbequ
  16 barboleus
   2 barboleusaz
   2 barcaroll
   2 barn
   4 baron
   2 barrier
   1 barrièr
   2 barton
   4 bas
  21 base
   5 basement
   1 basket
   3 bass
 326 bath
  21 bathrob
 566 bathroom
  58 bathroom_bath
  32 bathroom_shower
   6 bathtub
   1 baum
   2 bay
   1 bayview
   2 bbq
 209 beach
   4 beam
   1 bear
  28 beau
  17 beaulieu
   4 beausit
  37 beauti
 243 bed
 186 bed_breakfast
 139 bedroom
   2 bedspread
   1 beef
   3 beer
   6 beetschen
   1 beginn
   2 behind
   1 beig
   3 belalp
   8 bell
   6 bella
   1 bellagio
   3 bellefontain
  11 beller
  45 bellevu
  15 belmont
  64 belp
   1 beluard
   3 belvédèr
   2 bench
  31 benefit
   1 benno
  72 bern
  64 bern_belp
   7 bernard
   2 bernes
  16 berneus
   2 beryl
 187 besid
   1 bessièr
   1 besson
 454 best
  55 bestsel
   2 betjeman
   8 beverag
  65 bex
   1 beyond
  27 bicycl
   5 bidet
   6 big
   2 bigger
   1 biggest
  26 bike
   1 bill
   5 billiard
   2 biodegrad
   1 bis
   2 biscuit
   6 bistro
   1 bistrot
   1 bl
   3 black
  41 blanc
  17 blanch
   1 blend
  16 bleu
   5 bleue
   1 block
   4 blonay
   1 blu
   2 blécherett
  30 bnb
  11 board
  41 boast
  23 boat
   2 bobsleigh
   6 boeuf
  16 bogi
   2 bohemian
   1 boi
   1 boiler
   1 boit
   7 bon
   3 bonmont
  10 book
   1 booster
   5 border
   1 borgeat
   4 borzoi
   2 boscéaz
  12 bossey
   1 bosson
   6 bostan
   5 bottl
   2 botté
   4 bouchon
   2 boudoir
   2 bougainvill
   5 bougi
   4 bouquetin
   1 bourdonnett
   2 bourg
  30 boutiqu
  81 bouveret
   2 bowl
  71 box
   3 boël
  10 brand
   3 bras
  14 brasseri
   4 brassus
  31 bray
   4 bread
 449 breakfast
   7 breathtak
   2 breeder
  15 bretay
   1 brevent
   1 bridg
   9 bright
   3 bring
  41 bristol
   1 britannia
   1 broad
   2 brows
   2 broyard
   1 brunch
   1 brunet
   1 brunswick
   2 bruyèr
   1 brévent
  16 budget
  75 buffet
  40 buffet_breakfast
   9 bugnon
  69 build
  37 built
   2 bungalow
   1 bunk
   1 burger
  12 bursin
   3 bursinel
 293 bus
   2 bus_servic
 116 bus_stop
   7 buse
 132 busi
  78 busi_centr
   3 bussigni
   2 bustl
   1 butcher
   1 butter
   3 buy
   1 béjart
   2 bérard
   3 bürgle
   2 c13
   4 c2
   1 c3
   1 c4
   1 c54
  21 caban
  48 cabin
 254 cabl
  48 cabl_cabin
  37 cabl_channel
  95 cabl_tv
  22 café
   3 caillett
  10 calm
   2 calvi
   1 camera
   3 campus
   7 canal
   2 candlelight
  12 canton
   2 canyon
   2 cap
   1 capsul
   3 capt
 119 car
  22 car_essenti
   1 caravan
  36 card
   3 cardin
 203 care
  12 carlton
   3 carmen
   2 carnotzet
   3 carolin
   7 caroug
   1 carriag
  13 cart
   1 carter
   4 case
  66 casino
   2 cassiope
   1 cassiopé
   2 castaway
   2 castel
  47 castl
   3 casual
  57 cater
  53 cathedr
   1 cattl
   1 caux
   3 cavali
  11 cave
   2 cbar
   1 cbe
  65 cd
  60 cd_player
   1 cedar
   2 cedr
  14 ceil
   5 celebr
  11 cellar
   8 centaur
 289 center
 573 centr
  44 central
  28 centuri
   5 ceram
   3 cereal
   1 cergnat
  60 cergu
   8 certain
   1 certifi
  11 chablai
   4 chailli
  40 chain
   3 chair
 307 chalet
   3 chamaveau
  38 chambr
   2 chamoi
   7 chamonix
   5 chamossair
   1 champagn
   5 champel
  12 chang
 117 channel
   2 chant
   6 chantant
   2 chapel
   3 chaperon
   4 chaplin
 152 charg
   5 chargeabl
   1 charger
   3 charlot
  42 charm
   8 chasseur
   3 chat
  93 chateau
  89 chateau_oex
   2 chatel
   6 chauffeur
  52 chaurond
  13 chaux
  11 chavann
   2 chaîn
  11 check
   5 chees
  12 chef
   8 chemin
   2 cheseaux
   2 cheserex
   2 chesier
  69 chesièr
   2 chevrier
   7 chexbr
  24 chez
   2 chiblin
   2 chic
   1 chief
 213 children
  43 children_play
  94 children_playground
 310 chill
  36 chillon
  30 chillon_castl
   2 chines
   1 chinois
   7 chocol
 138 choic
  29 choic_travel
   7 choos
   2 chosen
   4 chouca
   1 choulet
  15 christma
   4 chrétien
   2 church
   4 churchil
   2 chuv
   4 châlet
  41 château
   6 châteauvieux
   2 châteauvieuxar
   1 chêne
   4 chênes
   1 cicg
   7 cig
  10 cigar
   4 cigogn
   7 cinema
 605 citi
   3 cityzen
  11 cité
   5 claren
   1 clarin
   4 clarmont
   8 class
  11 classic
   1 classifi
  22 clean
   3 clef
   1 client
   1 climat
   5 climb
   2 clinic
   1 clinton
  14 clock
  15 clos
 278 close
   1 closebi
  20 closest
   4 closet
  67 club
   1 clusaz
   3 clébard
  29 cm
   3 coach
  11 cocktail
 174 coffe
 126 coffe_machin
   1 cog
   4 coinsin
   9 cointrin
   3 col
   3 cold
   4 collect
   4 colour
   4 comballaz
   7 combin
 146 come
  36 comfort
   1 command
   1 commerci
  14 common
   9 commugni
  42 communal
   1 compani
 444 compar
 188 compar_properti
   1 complement
  25 complet
   7 complex
  19 complimentari
  10 compos
  16 compris
   7 comput
   3 comédi
   3 concept
   2 concert
   9 conch
   3 concierg
 143 condit
   1 condition
  20 confer
   4 confignon
   1 conformist
  11 congress
  27 connect
   2 conservatori
  20 consist
   1 consum
  14 contain
   2 contemporain
  12 contemporari
  39 continent
  36 continent_breakfast
   1 continu
   2 contribut
   3 control
  64 conveni
  51 conveni_public
  20 convent
   2 convert
   3 convivi
   9 cook
   1 cooki
   2 cool
   2 coppet
   6 coq
   3 coquelicot
   4 corbeyri
   1 cordial
  60 cornavin
  44 cornavin_train
  11 corner
   1 corridor
   5 corseaux
   4 corsier
  22 cosi
   1 cosili
   1 cosmet
   6 cossonay
   2 cossonnay
  19 cost
   1 cot
  11 cottag
   1 coté
   6 coucou
  21 countri
  18 countrysid
 326 coupl
 181 coupl_particular
   3 cour
  12 couronn
  72 cours
  15 court
   2 courtyard
  27 cover
   8 cozi
   2 craftwork
   6 crassier
   5 creat
   2 creation
   5 creativ
  18 cremin
   5 crissier
   3 cristal
   1 crochi
   1 croisett
   6 croissant
   6 croisé
  86 croix
  18 cross
   1 crousaz
   3 crown
   3 cruis
   1 crust
   1 crème
   4 crêt
   3 ctn
   2 cuban
   6 cudrefin
 102 cuisin
   1 culinari
   3 culli
  15 cultur
   2 cup
   2 cure
   1 currenc
   2 curtain
   2 custom
 112 cycl
   1 cèdre
   6 cédre
   2 céligni
   6 cénacl
   4 cîme
   1 d01
   1 d3
  26 daili
  17 dan
   1 daphn
   2 daphné
  25 date
  50 day
 367 de
  74 de_la
   8 deck
   1 deco
  28 decor
   2 dedic
   2 deep
   1 deer
   4 definit
   1 degre
   1 dehumidifi
   1 dejoinvill
   4 delicaci
   4 delici
   2 deliv
 217 demand
   2 deni
  13 dent
   2 depart
   2 departur
   2 depend
  68 deposit
   6 depth
 109 des
  38 des_grott
  18 design
 193 desir
  97 desk
   4 dessus
   3 deux
   4 develop
 120 diableret
   3 diamant
   2 diana
   1 diet
   9 differ
   1 digit
   1 dignitari
  10 dimens
   2 din
 114 dine
   1 diner
   1 ding
  15 dinner
   3 diplom
  49 direct
   6 directeur
   2 disabl
   2 discern
  23 discount
  23 discov
   3 discoveri
   1 discreet
  42 dish
 129 dishwash
  23 dishwash_oven
   8 dispos
  17 distanc
  37 district
   1 divis
   3 divonn
   1 dj
   8 dock
   1 dode
  32 domain
   2 domin
   2 donjon
  13 door
   3 doorstep
   3 dormitori
  22 doubl
   2 downhil
   1 downtown
   3 drake
   1 drawn
   4 dri
   1 drier
  40 drink
 112 drive
   2 drop
  61 dryer
 151 du
   2 duc
   2 duillier
   3 duma
   2 duo
   5 duplex
   4 durat
   1 duvet
 103 dvd
 100 dvd_player
   2 déco
  12 décor
   4 délice
   2 dévnes
   2 e23
   2 earth
  13 easi
  31 easili
  11 east
   1 eastern
   4 eastwest
   2 eat
  54 eau
  19 eaux
   1 echandol
   1 eco
   2 ecolog
   1 econom
   3 ecublen
   3 ecureuil
   3 edelweiss
   4 eden
   7 edg
   1 edgard
   1 effici
  18 eglis
   4 ein
   6 either
   9 electr
  49 eleg
   5 element
   8 elev
   3 elit
   1 ell
   1 embark
  14 emeraud
  44 en
  31 en_suit
   1 enchant
   6 encor
   2 endless
   3 energi
   5 engag
  17 english
   2 enhanc
   1 enhaut
 257 enjoy
   1 enlarg
   1 enough
   1 ensuit
   1 ensur
   2 enter
   3 entertain
  46 entir
   4 entitl
  13 entranc
   6 environ
   1 epess
  10 epfl
   6 epicur
   3 epicéa
   3 epinett
   6 epoqu
 216 equip
  23 equip_kitchen
   6 eridan
  13 ermitag
   3 escapad
   6 espagn
   2 especi
   1 esprit
   2 esprit3
  22 essenti
   1 essert
  11 essertin
   3 establish
  27 et
   3 etivaz
   5 etoil
   3 etoy
   1 eugèn
   6 europ
   2 european
  14 eurotel
   3 eva
  11 even
   6 event
   1 ever
  80 everi
  36 everi_morn
   2 everyth
   1 everywher
   4 evian
   2 evionnaz
  64 excel
  59 excel_locat
  14 excelsior
   2 except
   2 exchang
   4 exclus
   4 excurs
  16 exhibit
  14 exit
   9 experi
   1 experienc
  69 explor
  37 explor_walk
   2 expos
   2 exposit
   6 express
   2 exquisit
   4 extens
   1 extern
  89 extra
  26 extra_motor
   1 f6
   3 fabric
   1 fabul
  87 face
   9 face_posit
 138 facil
   1 faciliti
 256 fact
   1 factori
   1 faculti
   1 fade
   1 fair
   3 fairground
   3 falcon
   6 falk
  29 famili
   3 famill
  20 famous
   1 fan
   3 fanfan
   3 fantast
   2 far
   4 farm
   9 farmhous
   2 fassbind
   2 faucon
   2 fauvett
   1 favour
 229 favourit
   4 fax
 488 featur
   1 februari
   2 feder
   5 fee
  10 feel
   1 fellow
   3 femal
   2 fenc
   1 feng
  10 ferm
   3 ferri
   3 festiv
   3 feuill
 128 fi
  12 field
   1 fifth
   8 fil
   2 fillet
   1 film
   3 final
   3 financi
  47 find
  37 fine
   1 finest
   1 finger
   1 fire
  91 fireplac
   8 first
  18 fish
   2 fisherman
 213 fit
  48 fit_centr
   1 five
   1 fix
   2 flair
   2 flambé
 247 flat
 242 flat_screen
  11 fleur
  11 fleuri
   2 fleuron
   1 flexibl
   6 floatinn
   3 flon
  77 floor
   1 floral
   7 flower
   1 focus
   2 foie
   2 fondat
  10 fondu
  18 food
  14 foot
   6 footbal
   3 foothil
   6 footpath
   1 foreign
   7 forest
   2 form
   2 format
   3 former
   1 fortif
   6 forêt
   1 fouger
   1 fougèr
  80 found
   1 foundat
   4 fountain
   4 four
   1 framework
   5 franc
   1 franchis
   1 francigena
   3 franciscain
   1 franciscan
   3 franco
   4 fraser
   1 freddi
1054 free
 134 free_charg
 109 free_wi
 333 free_wifi
   2 freezer
  40 french
   5 frenièr
   7 frequent
  27 fresh
   9 fribourg
   7 friday
  36 fridg
 136 friend
   4 fring
  43 front
  11 fruit
  23 full
 102 fulli
  84 fulli_equip
   1 fumoir
   3 fun
   8 function
   6 funi
   4 funicular
   1 furbish
  67 furnish
  31 furnitur
 194 furthermor
   2 fusion
   1 fédéral
   1 fées
   5 gai
   8 galion
   6 galleri
   3 gama
   3 gamat
   8 game
  15 garag
 284 garden
  32 gare
   2 garenn
   6 garni
   1 gas
   2 gaston
   2 gastronom
   1 gastronomi
  11 gault
   5 gautier
   2 gel
   1 general
   1 generous
  39 genev
1183 geneva
 231 geneva_intern
   3 genevanest
   4 genf
   8 genthod
   1 gentil
   2 genuin
  74 genèv
   4 georg
   2 geotherm
  10 german
  44 gervai
 275 get
   1 geteillon
   3 ghazali
   2 gianadda
   2 giant
   9 gilli
   4 giroll
   3 gitana
   9 give
   1 given
   7 glacier
   9 gland
   3 glani
  10 glass
   3 glaze
   5 glion
   1 globe
   1 glorious
   1 glow
   2 gluten
 172 go
   1 goat
   2 goe
 116 golf
  68 golf_cours
   3 gondola
  12 good
   3 goos
   2 gothic
   3 gottrau
   2 goumoen
  15 gourmet
   1 graffiti
   6 grain
   1 granci
  46 grand
   4 grandson
   6 grandvaux
  15 grang
   5 grangett
   2 grape
   2 gras
   1 graze
 184 great
 104 great_choic
   8 green
   4 grenad
   4 grenat
   2 grevin
   2 grice
   5 grill
   2 grillon
   3 griott
  15 grise
   1 grizzli
  60 grocer
  18 groceri
   2 groom
   2 gros
  39 grott
  30 ground
   1 group
   4 grow
   4 grower
   5 gruyèr
  61 gryon
   2 gryonn
   9 gstaad
1224 guest
 224 guest_favourit
 259 guest_get
 188 guest_happier
 119 guest_hous
  11 guesthous
   1 guestroom
  10 guid
   9 gym
   1 géteillon
   2 haeberlin
   1 hair
   2 hairdress
 166 hairdryer
  15 half
  11 hall
   1 hallway
   3 hamam
   2 hamburg
   2 hamlet
  76 hammam
   3 hand
   1 hang
   3 happi
 188 happier
  52 harbour
   8 harmoni
  10 haut
   2 hd
   2 hdtv
   3 head
   7 headquart
   3 health
   2 healthcar
 283 heart
   2 hearth
  25 heat
   8 heidi
  11 height
   3 help
   3 helveti
   6 heritag
   1 hermè
   2 hi
   2 hibou
  16 high
   5 highest
   1 highland
  10 highlight
   3 highway
 115 hike
   7 hill
   6 hire
  46 histor
  22 histor_build
   5 histori
   4 hob
  57 hole
 156 holiday
 147 holiday_home
 160 home
   9 homemad
   3 homestay
   1 honour
   6 horlog
  68 hors
  58 hors_ride
   5 hospit
   2 host
 134 hostel
  27 hostelleri
  72 hot
  46 hot_tub
   3 hote
 756 hotel
  11 hotplat
 102 hour
 309 hous
   1 housekeep
   1 huit
   2 hustl
   2 hyacinth
  12 hôte
 145 hôtel
   4 hôtelièr
   3 hôtelleri
  14 hôtes
  46 ibi
  68 ice
  59 ice_rink
  12 ideal
   2 idyl
   6 ii
   2 iii
   2 illi
   2 illustr
  13 immedi
   1 imperi
 170 import
   8 impress
   4 impérial
 302 includ
 251 inde
 218 independ
  19 individu
 114 indoor
  70 indoor_swim
   3 indulg
   2 industri
   6 inform
  11 ingredi
  21 inn
   3 innov
   1 input
   9 insid
   2 inspir
   1 instant
   3 institut
   2 integr
  14 inter
   6 interact
   1 intercom
   2 interconnect
   5 intercontinent
   1 intercontitnent
 152 interest
   1 interfac
   5 interhom
   6 interior
 292 intern
   3 intern_airport
  62 internet
   4 intim
   6 invent
  16 invit
   6 ipad
   1 iphon
   9 ipod
   2 irish
   9 iron
   3 ise
  22 isenau
   7 isl
   1 itali
  22 italian
   1 item
   2 iv
   1 j5
   1 jacuzzi
   5 jade
   5 jam
   6 janet
   3 japanes
   9 jardin
   2 javernaz
   1 jazz
   7 jean
  37 jet
  37 jet_eau
   6 jetti
   1 jeun
   1 jeunotel
   1 jimmi
   1 jog
   1 john
   7 jonction
   4 jorass
   1 jost
   3 jour
   1 journal
   1 journey
   3 joux
   6 juic
   3 juli
   1 june
  15 jura
   1 just1
   3 keep
   3 kelli
   1 kennedi
   1 kept
  24 kettl
   2 khamariah
   5 kid
   3 kilomet
   2 kilomtr
   1 kind
   3 king
   2 kiosk
   5 kipl
 323 kitchen
  67 kitchen_dishwash
  58 kitchenett
   3 kitchenwar
1913 km
   1 knife
  19 known
   1 kobe
   2 kruger
   3 kumon
  12 kutchi
 363 la
  31 la_bray
   2 labyrinth
  36 lac
   6 lacotel
   1 lactos
   5 lagun
 518 lake
   4 lakefront
   1 lakeshor
   8 lakesid
   2 lan
   6 lanci
   6 land
   2 landmark
   4 landscap
   3 languag
   7 laptop
   3 larem
  77 larg
   2 largest
   3 las
   1 late
   3 latest
   1 latter
  68 laundri
 399 lausann
  18 lavaux
   1 lavazza
   5 lavey
   6 lavigni
   1 lavish
   8 lawn
   2 layeux
   6 lcd
 215 le
  25 le_bristol
   7 lead
   2 least
   4 leather
   1 leav
   1 lebanes
   1 lebanon
   1 led
   1 left
   1 legendari
   8 leisur
   5 leman
   1 lend
   4 length
   1 leopard
 396 les
 103 les_diableret
   9 less
   1 let
  11 leukerbad
  13 level
 143 leysin
  62 librari
   4 lido
   3 lie
   3 life
 347 lift
   6 light
   2 ligneroll
   5 lignon
3094 like
 181 like_locat
   6 lila
   3 limit
   2 limousin
  21 line
  33 linen
   2 link
   8 lion
   8 list
   2 listen
  10 littl
  68 live
   2 liver
  10 livr
  10 lobbi
  62 local
1086 locat
  46 locat_show
   1 lock
   3 locker
   6 lodg
   7 loft
   3 lonay
   6 long
   3 longchamp
   1 longemall
   1 longer
   6 longerai
 206 look
   7 lot
  45 loung
   2 lounger
 793 love
   2 lover
   5 lower
   2 luckey
   9 luggag
   3 luin
   1 lumin
  12 lunch
   2 lunchtim
   6 lush
   4 lutri
  40 luxuri
   4 lécherett
  13 léman
   3 lézard
   6 lʼabbay
   1 m1
  12 m2
 289 machin
  20 made
   4 magazin
   2 magellan
   3 magnet
   7 magnific
   3 maid
   3 mail
  38 main
  24 maison
   8 majest
   4 major
  29 make
   5 maker
   5 malagnou
   3 malandr
 106 mall
   8 malley
  30 mani
   6 manoir
  22 manotel
   1 mansion
   2 manufactur
 125 map
   2 maraîch
   4 marbl
   2 marc
   2 march
   2 marchairuz
   1 marché
   8 marignac
  14 marina
   1 mark
  22 market
  96 marketplac
   4 martigni
  59 massag
   2 massif
   1 master
   2 materi
   8 mathod
   5 matin
   1 matur
  13 mauric
  14 may
  18 mayen
  21 mazot
   1 mb
  15 meadow
  15 meal
   4 meat
   2 media
   1 medic
  16 mediev
   9 mediterranean
  18 meet
   1 meilleret
   2 member
   1 memori
   5 menu
   5 menus
   2 mer
   1 mercuri
   1 mere
   2 meribel
   2 merymont
   1 meter
   3 meticul
  12 metr
  31 metro
   1 mezzanin
   2 mgalleri
   5 michel
   6 michelin
   6 miclivi
   5 micro
 129 microwav
   1 mid
   6 middl
  15 midi
   3 mie
   2 migro
   2 mill
   9 millau
   2 milleau
   2 min
   4 mine
   3 mini
  17 miniatur
 128 minibar
   1 minigolf
 561 minut
  69 minut_drive
 246 minut_walk
   3 mirabeau
   2 mirabell
   1 mirror
   3 miss
   3 mix
   1 mobil
  75 modern
   1 modernis
   1 modernist
   1 moment
   8 mon
   2 monaco
   1 mond
   8 monday
 256 money
 256 money_compar
  52 mont
  41 mont_blanc
   2 montagnett
   2 montagni
   6 montana
   2 montblanc
   4 montbril
  12 month
   1 montoi
 384 montreux
   3 montrich
   3 montriond
   2 monument
   6 moor
   2 morat
   1 morcl
 169 moreov
   1 morez
  84 morg
   2 morgen
  58 morn
   2 mort
   5 morzin
   1 mosaic
   3 mosaiqu
   7 moss
   8 motel
  34 motor
   6 motor_access
   1 motorbik
   1 motorcycl
  17 motorway
   7 moulin
 324 mountain
 105 mountain_view
   2 movi
   2 mq
   2 much
   1 muesli
   2 multi
   2 multilingu
   1 municip
   4 murten
   2 murtense
   3 musardier
   9 musardièr
  58 museum
  27 music
   1 musiqu
 195 must
   2 mustard
  23 musé
  22 musé_nation
   1 muveran
  18 m²
   2 mécaniqu
   4 métropol
   3 mövenpick
   3 name
   3 nash
  87 nation
  14 natur
   2 navig
   3 nay
 302 near
 377 nearbi
 165 nearest
 157 nearest_airport
   1 necess
   8 need
   2 neig
   2 neighbourhood
  10 nespresso
   8 nest
   2 nestl
   3 network
   8 neuchâtel
   1 neutral
   9 new
  11 newli
   6 newspap
  51 next
   3 nh
 208 nice
   5 night
   2 nightcap
   1 ninth
   2 nois
   4 noiseti
  25 non
   1 noon
   8 nord
   2 north
   1 northern
   1 northwestern
  75 note
   5 nouveau
   3 nouvell
   2 novemb
   2 novic
   1 novotel
   3 nuit
   2 number
   8 numer
   1 nut
  96 nyon
   1 occitan
   9 occupi
   3 ochettaz
   2 octob
  93 oex
 665 offer
  13 offic
   1 oil
 111 old
  92 old_town
   1 older
   1 oldest
   2 olivo
 242 ollon
  18 olymp
 334 one
   1 one_best
  55 one_bestsel
  49 one_top
   5 onto
   3 onu
   2 onyx
   2 opal
  75 open
   3 oper
   2 opera
   6 opportun
  24 opposit
  13 option
   1 orang
   5 orb
   2 orchard
   7 order
  10 organ
  15 organis
   5 origin
  56 orsay
   9 other
   3 ott
   5 ouat
  25 ouchi
   1 ouest
  64 outdoor
   2 outlet
 586 outsid
  23 outskirt
  97 oven
  27 overlook
   3 own
   4 owner
   2 oyster
   1 p1
   2 p5
   2 paccot
   1 paddl
   7 paid
   1 pain
   5 paint
  11 paix
  63 palac
  12 palai
   1 palat
  51 palexpo
   3 palmier
   2 palézieux
   2 panel
  66 panoram
  56 panoram_view
  24 panorama
   1 paper
  31 paqui
  29 paqui_great
   1 paraglid
  31 parc
   5 parent
 483 park
  34 park_avail
  66 park_spot
   1 parkland
   3 parquet
 229 part
  75 part_villar
   3 partial
 324 particular
 143 particular_like
  13 pass
   3 past
   1 pasta
   8 pastri
   1 pastur
   2 patara
  11 path
  79 patio
   2 paudex
   4 paudèz
   5 pavilion
   2 pavoi
   3 pax
   3 pay
  10 payern
   2 pc
  12 peac
   5 peak
   1 pearl
   7 pebbl
   2 pedal
  11 pedestrian
   7 peilz
   1 pendulum
   4 peney
   3 pension
   4 peopl
   1 pepper
   2 perc
  11 perch
   6 perfect
  10 period
   4 perl
   1 perous
   8 perrin
   4 perroy
 334 person
 322 person_trip
   1 personalis
 127 pet
 125 pet_friend
  53 petit
   3 phare
   1 pharmaci
   8 philipona
   2 philipp
   3 phone
   1 photographi
   1 pi
   3 piano
  49 pick
  11 picturesqu
   2 piec
   1 pier
  38 pierr
   1 pierr_cathedr
   1 pilat
   1 pillar
   1 pillon
   1 pillow
   2 pin
   1 ping
   1 pint
   2 piran
   1 pirat
   3 pist
   2 pizza
   2 pizzeria
 728 place
   9 plage
   7 plainpalai
  20 plan
   1 planch
   2 planet
   1 planpalai
   5 plant
   2 plasma
   3 plate
   3 plateau
 193 play
 165 player
 100 playground
   5 playroom
   1 playstat
   8 plaza
 114 pleas
  75 pleas_note
   2 pleas_take
   4 pleasant
   1 pleiad
   1 plenti
   1 plug
  92 plus
  35 point
   1 poivr
   1 polytechniqu
   4 pond
   1 pong
   4 poni
   7 pont
 320 pool
  35 popular
  32 port
   1 portabl
   2 portaz
   2 porthol
   2 portugues
 102 posit
  68 possibl
  13 post
   2 practic
   8 praill
   2 prairi
   6 pralay
   4 prangin
   6 praz
   3 prealpina
 214 prefer
   2 preferenti
   1 prehistor
   7 premis
   3 prepaid
  10 prepar
   2 presbytèr
   1 present
   5 presid
   2 presing
   1 pressread
   5 prestigi
   2 price
   1 primarili
   2 prime
   1 princess
   1 principl
   6 printer
   8 prior
 457 privat
 199 privat_bathroom
 177 privat_park
   4 privileg
   4 produc
  34 product
   1 profession
   2 projector
   6 promenad
   1 promenthoux
   2 proof
1671 properti
   4 protect
 241 provid
  14 proxim
   2 pré
   3 prés
  15 pub
 213 public
  93 public_transport
   2 puidoux
   2 pump
   2 pâquier
   1 pésage
   2 pétanqu
   6 quai
   9 qualiti
  10 quarter
   4 quartier
   3 queen
   2 quick
  78 quiet
  29 quiet_sunni
   3 quina
   1 quotidien
   5 racca
   1 rack
   8 raclett
   1 radiat
   2 radio
   1 radius
   2 rail
  86 railway
  81 railway_station
   2 rain
   6 raisin
   6 ramada
  28 rang
  52 rass
 797 rate
 256 rate_best
 322 rate_two
   1 rath
   6 ravet
   1 ray
 127 reach
  39 reach_within
  43 reachabl
  29 reachabl_within
   3 read
   2 readi
   7 real
   2 realis
 232 reason
  22 receiv
   4 recent
  96 recept
  13 recommend
   1 red
   1 redesign
   1 reduct
   6 refin
   1 reform
   1 refresh
  88 refriger
   4 refurbish
  14 regina
 136 region
   2 regular
  13 relai
 424 relax
   1 religi
   1 remain
   3 renard
   2 renardièr
   3 renen
   2 renew
  53 renov
   7 renown
  41 rent
  29 rent_resid
  20 rental
   3 rené
   1 reopen
   1 repair
   4 repo
   2 repres
   1 reproduct
   2 reput
 480 request
  14 reserv
 106 resid
   7 residenti
  20 resort
   4 respect
   1 respond
   1 rest
 508 restaur
   1 restaurateur
   2 restor
 218 review
   1 reward
  10 rhodonit
   9 rhone
   6 rhône
   2 riant
  13 rich
   4 richemond
  95 ride
  58 right
  64 rink
   2 riponn
   1 ripp
   2 rise
   6 ritz
  23 rivag
  11 rive
  11 river
  33 riviera
  16 road
   1 robe
  58 roc
  56 roc_orsay
  20 roch
   4 rochefort
   8 rochegris
   3 rocher
   2 rock
  28 roll
   6 roman
   1 romant
   3 romantik
   2 roof
   2 rooftop
1585 room
   2 rosali
  24 rosat
   2 rosatlit
   2 rose
   2 rosier
   2 rosièr
   2 rossignèr
  43 rossinièr
   2 rotari
   2 roth
  11 roug
   3 roulott
   3 round
   4 rouss
   5 rout
  23 royal
   4 royalp
   2 rubi
  15 rue
   3 ruin
  67 run
   6 rural
   1 russian
  11 rustic
   1 ruvin
   3 régina
  68 résidenc
   6 réunion
   1 rôtisseri
   2 saanenland
   4 saconnex
  21 safe
  68 safeti
  60 safeti_deposit
   1 sail
 185 saint
  56 saint_cergu
  40 saint_croix
  38 saint_gervai
   1 saison
   3 salad
   2 salavaux
   1 sale
   2 sallaz
   5 salt
   6 sampl
   2 sanarium
   1 sandwich
   4 sanluca
   7 saphorin
  16 sapin
   1 sarraz
  85 satellit
  24 satellit_channel
  47 satellit_tv
   1 satisfi
 126 sauna
   1 sauvag
  74 save
   4 savoi
   3 savour
  11 savoy
   6 sc1
   1 scanner
  49 sceneri
  15 scenic
   1 scheme
 188 school
 244 screen
   2 scrumptious
   1 sculptur
   6 sea
  43 season
  80 seat
  74 seat_area
   2 second
   6 secur
   1 seduc
   1 see
 222 seek
   2 sejour
  44 select
  56 self
  54 self_cater
   1 sell
   2 semi
   5 seminar
   5 sentier
  28 separ
   7 septemb
   3 serac
   3 seren
 164 serv
   4 servett
 303 servic
   1 session
 138 set
   1 seventy5
  30 sever
   3 shade
   7 shadi
   1 shape
 129 share
  65 share_use
   1 sheep
   1 sheet
   3 ship
   3 shms
   4 shoe
 173 shop
  38 shore
  34 shore_lake
   5 short
 128 show
  78 show_map
 129 shower
   1 shui
 114 shuttl
  80 shuttl_servic
   3 si
   3 side
   1 sight
   9 sightse
   2 sign
   5 signal
   2 signpost
   6 silen
 191 similar
   1 simment
   4 simpl
   3 simpli
   1 simplon
   1 sinatra
   2 sinc
   2 singl
   2 sip
   4 sit
 210 site
 137 situat
   8 size
   3 siècl
   7 skate
 903 ski
 136 ski_bus
 194 ski_lift
 185 ski_school
  91 ski_storag
   4 skisport
   3 sky
   1 sled
   2 sledg
   1 sleek
   5 sleep
   6 slide
   1 slight
  11 slipper
  28 slope
  39 small
   1 smartphon
  22 smoke
   1 smoker
  25 snack
   2 snorkel
  53 snow
   4 snow_chain
   2 snowsho
   1 social
   3 soeur
 154 sofa
   1 sofab
   1 sofitel
   4 soft
   1 solalex
   1 solarium
  30 soleil
   1 solepraz
2617 someth
   2 sommeli
   2 sophist
   2 soul
   2 sound
  19 soundproof
  11 sourc
  13 sous
  64 south
  53 south_face
   1 southward
   2 souvenir
  78 spa
  71 space
  61 spacious
   9 spanish
   2 spas
   8 speak
  36 special
   7 specialis
   3 specialti
   5 spectacular
   5 speed
 576 spend
   3 spice
   1 spirit
   7 splendid
   1 splendour
   1 spoken
 117 sport
  59 sport_centr
  48 sport_harbour
  69 spot
   3 spread
   2 spring
   6 squar
   1 squash
  59 st
  37 st_pierr
   6 stabl
  20 stade
  12 staff
   2 stage
   2 stain
   1 stair
   3 staircas
   3 stand
   3 standard
  41 star
  14 starl
  23 start
   2 stasburg
   4 state
 433 station
   1 statu
 174 stay
 124 stay_heart
   9 ste
   2 steak
  11 steam
   2 steamboat
   1 steamer
   7 steep
  23 step
   2 stereo
   2 still
   6 stock
   5 stone
 195 stop
 106 storag
   8 storag_space
  19 store
  29 storey
   2 stove
   9 stovetop
   6 strasbourg
  19 street
   3 stroll
   1 structur
  77 studio
   2 stun
  61 style
  13 stylish
   2 stöckli
   1 subject
   2 subtl
   1 success
   1 sugar
  33 suiss
  59 suit
   9 suitabl
   2 sulpic
  54 summer
   2 summit
   1 sumptuous
  90 sun
  88 sun_terrac
   1 sunday
  46 sunni
  12 sunni_posit
   2 sunset
   4 superb
   7 superior
  31 supermarket
   8 suppl
   1 supplement
   1 suppli
 250 sur
  75 sur_ollon
  28 surcharg
   2 surfac
   2 surpris
 126 surround
   1 sushi
   2 sustain
   1 swedish
   4 sweet
 242 swim
 171 swim_pool
   9 swin
   2 swing
 125 swiss
  26 swiss_riviera
   1 swissmobil
  14 swisstech
   7 switzerland
   9 system
   1 sécheron
   2 séjour
   3 sépey
   3 sérénité
  77 tabl
  45 tabl_tenni
   1 tablet
   2 tabletop
   1 tag
  71 take
  36 take_snow
   1 taken
   3 tapa
   2 tart
   4 tartar
   4 tartegnin
  16 tast
   4 tasti
   4 taverni
   3 taveyannaz
   2 tax
   2 taxi
  45 tea
  29 tea_coffe
   3 technogym
   7 technolog
  11 telephon
   1 televis
 201 tenni
  46 tenni_club
  17 termin
   4 terminus
 451 terrac
   3 terrass
   1 terreaux
   2 tesla
   1 testifi
   4 thai
   1 thank
   1 thaï
  10 theatr
   6 theme
   2 therapi
 246 therefor
  74 thermal
  62 thermal_bath
   2 thick
   1 thin
   4 third
  13 three
  64 throughout
   1 thursday
   3 thus
   2 théâtre
  20 ticket
  10 tiffani
   1 tile
   1 till
 584 time
   9 tine
   3 tivoli
  10 toaster
   9 toboggan
  92 toilet
  51 toiletri
   1 tone
   2 tool
  53 top
   2 topaz
   3 tor
   2 toscan
   2 touch
  15 tour
  13 tourell
  10 tourist
   3 toward
  33 towel
   2 tower
 218 town
   3 track
   1 trade
  41 tradit
  22 trail
 247 train
 165 train_station
   1 trainer
   3 tralala
  13 tram
  19 tranquil
   6 transfer
 153 transport
 210 travel
 103 travel_interest
  74 travel_save
   1 tray
   4 treasur
   3 treat
  22 treatment
  24 tree
   8 trembley
   3 treyblanc
   1 trient
   1 trilbi
 346 trip
   2 tropic
   2 truck
   1 true
   1 truffl
   3 truit
   4 truli
   3 tsalounâ
  84 tub
   2 tube
   1 tuesday
  10 tulip
  50 tumbl
  49 tumbl_dryer
   1 tunnel
   5 turkish
 560 tv
  48 tv_cabl
   4 tvs
   1 twice
   4 twin
   2 twist
 346 two
   2 two_person
   2 type
  16 typic
   1 télécord
   8 tête
   1 ultim
   1 umami
  16 un
   2 und
   5 underfloor
   5 underground
   9 unesco
   1 unforgett
   1 unhcr
   1 unheat
   1 uni
   3 unil
   2 uninterrupt
  10 union
  15 uniqu
 159 unit
  46 unit_nation
  10 univers
   4 unlimit
   1 unmad
   1 unpretenti
   1 unsuit
   4 unwind
  25 upon
  13 upper
   4 urban
 152 use
  11 vacanc
   2 val
  15 valai
   3 valentin
   4 valeri
   3 valet
   5 valid
  22 valley
   4 vallonett
   2 vallorb
   1 vallé
   3 valros
 256 valu
  15 vapeur
   4 vari
  12 varieti
  45 various
   3 vasco
   3 vast
  37 vaud
  27 vaud_region
   1 vaudoi
   3 vaudois
   2 vegetarian
   2 velvet
   5 vend
   2 vende
   1 vendé
   1 venn
   1 ventil
   2 venu
  33 ver
   4 verbier
   1 vermont
   1 vernet
   1 vernex
   1 vernier
   2 versmont
  13 versoix
  93 vevey
  10 via
   1 vibe
  18 vicin
  22 victoria
   7 video
   5 vieill
   3 vieux
 535 view
   5 vigi
   1 viii
  27 vill
 144 villa
  54 villag
 446 villar
  44 villar_palac
 143 villar_sur
   3 villarepo
  41 villeneuv
   3 vinegar
  15 vineyard
  21 vioz
   4 vision
   2 visionapart
  12 visit
   3 visitor
   2 visual
   3 viticol
  21 vive
   6 vivi
   1 voic
   1 volleybal
   1 voucher
   3 voyageur
   9 vuarin
   4 vufflen
   4 vuissen
   8 vuiteboeuf
   2 vulli
   4 vy
   1 véranda
   1 waadt
   1 wagon
   1 wagyu
   2 wake
   3 walikng
 420 walk
  14 walk_beach
  12 wall
 209 want
  23 wardrob
   7 warm
   4 warmer
 152 wash
 151 wash_machin
   5 washbasin
   1 washington
   1 wast
   9 watch
   2 watchmak
  18 water
   1 waterfal
   4 waterfountain
   3 waterfront
   5 wave
   4 way
   4 wc
   1 wed
  15 week
  17 welcom
 238 well
   6 wellingtonia
   4 west
   9 western
   1 whatev
   3 whilst
   2 white
 126 wi
  17 wi_fi
  27 wide
  11 width
 430 wifi
   1 will
   4 wilson
   3 win
  15 window
   1 windsurf
  68 wine
  76 winter
  36 winter_pleas
   8 winterfel
   4 wire
  27 wireless
  24 wireless_internet
   2 wise
   5 wish
 205 within
   2 wlan
   4 women
   6 wonder
  12 wood
  26 wooden
  11 work
   2 workstat
  24 world
   2 worth
1813 would
   2 wrought
   1 wto
   3 xi
   3 xvi
  25 year
   4 yet
   1 yoga
   3 yoghurt
   1 yogi
   1 yogurt
   4 yoko
   1 york
   3 young
   7 youth
  65 yverdon
  14 yvonand
   6 yvorn
   2 yvrone
   2 zan
   7 zen
   2 zenith
   5 zone
   2 zoo
   2 zurich
   1 école
   2 époqu
   3 évian
